XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/

#include "stm32l4xx_it.h"
#include "stm32l4xx_hal.h"

#include "stm32l4xx_ll_system.h"
#include "stm32l4xx_ll_gpio.h"
#include "stm32l4xx_ll_exti.h"
#include "stm32l4xx_ll_bus.h"
#include "stm32l4xx_ll_cortex.h"
#include "stm32l4xx_ll_rcc.h"
#include "stm32l4xx_ll_utils.h"
#include "stm32l4xx_ll_pwr.h"
#include "stm32l4xx_ll_dma.h"
#include "stm32l4xx_ll_wwdg.h"
#include "stm32l4xx_ll_iwdg.h"
#include "stm32l4xx_ll_rtc.h"

#include <math.h>
#include "sdmmc.h"
#include "spi.h"
#include "usart.h"
#include "gpio.h"
#include "rtc.h"
#include "log.h"
#include "stateMachine.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "cmd.h"
#include "bsp_gps.h"
#include "fatfs.h"
#include "config_ini.h"
#include "bsp_ads127.h"
#include "mem_dma.h"
#include "main.h"
#include "system_typedef.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */


#pragma clang diagnostic push
#pragma ide diagnostic ignored "EndlessLoop"

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

#define TIME_FILE_PATH               "0:/time.txt"

typedef union {
    struct {
        uint32_t self_test : 1;
        uint32_t analog : 1;
        uint32_t analog_init : 1;
        uint32_t cmd : 1;
        uint32_t cmd_init : 1;
        uint32_t gps : 1;
        uint32_t gps_init : 1;
        uint32_t buzzer : 1;
        uint32_t pvd_below : 1;
    };
    uint32_t val;
}system_fild_t;

static system_fild_t sys_fild = {.val = 0};

static system_config_t system_config = {
        .system = {
                .uart_baudrate = 921600,
        },
        .gps = {
                .baudrate = 9600,
        },
        .ads = {
                .ctrl = {.conver_rate = UINT32_MAX, .file.val = 60 << 2},
        },
        .sd = {
                .fm = {.val = 4},
                .file_limit = 1,
        },
        .rtc = {
        },
};

static FATFS* sd_fs_handle = NULL;

#define ANALOG_BUZZER_NUMBER          10
struct analog_domain_data_s{
    FATFS* *fs;
    FIL ads_data_file;
    char dir[32];
    rtc_date_time_t file_create_time;
    SPI_HandleTypeDef_Handle ads_spi_handle[2];
    ads127_dev_t device;
    system_config_t *sys_config;
    uint32_t clk;
    uint64_t th;
    system_fild_t *fild;
    int error;
    uint16_t err_counter;
    uint8_t buzzer_number;

};

static struct analog_domain_data_s analog_data_domain = {
        .fs = &sd_fs_handle,
        .ads_data_file = { 0 },
        .file_create_time = {.time.val = 0, .date.val = 0},
        .ads_spi_handle = {NULL, NULL},
        .device = ADS127_DEFAULT_DEVICE(),
        .sys_config = &system_config,
        .clk = 16000000,
        .th = 62500 * 4 * 60,
        .fild = &sys_fild,
        .error = 0,
        .err_counter = 0,
        .buzzer_number = ANALOG_BUZZER_NUMBER,
};

struct gps_domain_data_s {
    FATFS* *fs;
    UART_HandleTypeDef *gps_uart_handle;
    uint32_t pps;
    system_config_t *sys_config;
    system_fild_t *fild;
    int error;
};


static struct gps_domain_data_s gps_data_domain = {
        .fs = &sd_fs_handle,
        .gps_uart_handle = NULL,
        .pps = 0,
        .sys_config = &system_config,
        .fild = &sys_fild,
};

struct cmd_domain_data_s {
    FATFS* *fs;
    UART_HandleTypeDef *cmd_uart_handle;
    system_config_t *sys_config;
    system_fild_t *fild;
    int error;
};

static struct cmd_domain_data_s cmd_data_domain = {
        .fs = &sd_fs_handle,
        .cmd_uart_handle = NULL,
        .sys_config = &system_config,
        .fild = &sys_fild,
};


struct idle_domain_data_s {
    FATFS* *fs;
    struct analog_domain_data_s * analog_domain;
    struct gps_domain_data_s * gps_domain;
    struct cmd_domain_data_s * cmd_domain;
    uint32_t start_tick;
    system_fild_t *fild;
};


static struct idle_domain_data_s idle_data_domain = {
        .fs = &sd_fs_handle,
    .analog_domain = &analog_data_domain,
    .gps_domain = &gps_data_domain,
    .cmd_domain = &cmd_data_domain,
    .start_tick = 0,
    .fild = &sys_fild,
};


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

typedef enum{
    SYS_CORE_FREQ_32M = 32000000UL,
    SYS_CORE_FREQ_36M = 36000000UL,
    SYS_CORE_FREQ_48M = 48000000UL,
    SYS_CORE_FREQ_64M = 64000000UL,
    SYS_CORE_FREQ_72M = 72000000UL,
    SYS_CORE_FREQ_80M = 80000000UL,
}SYS_Core_Freq_t;

static uint8_t LL_SystemClock_Config(uint32_t in_clock_index, uint32_t in_clk_freq);
static void SystemClockHSE_Config(SYS_Core_Freq_t in_clk_freq);
static void Clock48_Domain_Cofing(void);
static void RTCClockLSE_Config(void);
static void pvd_pvm_isr_handler(void *ctx);


typedef enum{
    MCO_FREQ_1M = 10000000UL,
    MCO_FREQ_2M = 2000000UL,
	MCO_FREQ_4M = 4000000UL,
	MCO_FREQ_8M = 8000000UL,
	MCO_FREQ_16M = 16000000UL
}mco_freq_t;


static void core_get_device_uid(char* id, uint8_t len){
#define HEX "0123456789ABCDEF"
    uint32_t uid[3] = {0, 0, 0};
    uint8_t i = 0, j = 0;
    for(i = 0; i < 3; i++){
        uid[i] = READ_REG(*((uint32_t *)(UID_BASE + i * 4U)));
        for(j = 0; j < 8; j++){
            if(i * 8 + j < (len - 1)) id[(i << 3) + j] = HEX[(uid[i] << (j << 2) & 0xF0000000) >> 28];   // DEC >> HEX
            else{
                id[len - 1] = '\0';
                return;
            }
        }
    }
    id[(i << 3) + j + 1] = '\0';
#undef HEX
}


static void gpio_buzzer_warning(uint32_t keep_time, uint32_t on_time, uint32_t off_time){

