XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/Core/Src/main.c
}

static void core_iwdg_initialize(uint32_t ms_timeout){
    UNUSED(ms_timeout);
    IWDG_HandleTypeDef iwdg = {.Instance = IWDG, .Init.Prescaler = IWDG_PRESCALER_256, .Init.Window = IWDG_WINDOW_DISABLE, .Init.Reload = 3750};

    HAL_IWDG_Init(&iwdg);
}

static inline void core_iwdg_refresh(void){
    WRITE_REG(IWDG->KR, IWDG_KEY_RELOAD);
}

static void core_enter_sleep_mode(void){
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);

    LL_LPM_EnableSleep();
    LL_LPM_EnableSleepOnExit();
//	CLEAR_BIT(SCB->SCR, ((uint32_t)SCB_SCR_SLEEPONEXIT_Msk));  // 立即进入Sleep
//	SET_BIT(SCB->SCR, ((uint32_t)SCB_SCR_SLEEPONEXIT_Msk));    // 响应完所有中断再进入中断
//	CLEAR_BIT(SCB->SCR, ((uint32_t)SCB_SCR_SLEEPDEEP_Msk));
    __WFI();
}

static void core_enter_power_mode(uint32_t power_mode){
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);

    if (LL_PWR_IsActiveFlag_SB() != 0){
        LL_PWR_ClearFlag_SB();
    }

    if((power_mode == LL_PWR_MODE_STANDBY) || (power_mode == LL_PWR_MODE_SHUTDOWN)){
        LL_PWR_ClearFlag_WU();
        LL_PWR_ClearFlag_WU5();
        LL_PWR_ClearFlag_WU4();
        LL_PWR_ClearFlag_WU3();
        LL_PWR_ClearFlag_WU2();
        LL_PWR_ClearFlag_WU1();
        LL_RTC_ClearFlag_WUT(RTC);
        LL_RTC_ClearFlag_ALRB(RTC);
        LL_RTC_ClearFlag_ALRA(RTC);
        LL_RTC_ClearFlag_TS(RTC);
        LL_RTC_ClearFlag_ITS(RTC);
    }

    LL_PWR_SetPowerMode(power_mode);
    LL_LPM_EnableDeepSleep();
    LL_LPM_EnableSleepOnExit();

    /* This option is used to ensure that store operations are completed */
#if defined ( __CC_ARM)
    __force_stores();
#endif
    /* Request Wait For Interrupt */
    __WFI();
}


static void core_mco_enable(mco_freq_t mco_feq){

	LL_AHB2_GRP1_EnableClock(LL_AHB2_GRP1_PERIPH_GPIOA);

	LL_GPIO_SetPinPull(GPIOA, LL_GPIO_PIN_8, LL_GPIO_PULL_DOWN);
	LL_GPIO_SetPinOutputType(GPIOA, LL_GPIO_PIN_8, LL_GPIO_OUTPUT_PUSHPULL);
	LL_GPIO_SetPinSpeed(GPIOA, LL_GPIO_PIN_8, LL_GPIO_SPEED_FREQ_VERY_HIGH);
    LL_GPIO_SetPinMode(GPIOA, LL_GPIO_PIN_8, LL_GPIO_MODE_ALTERNATE);
    LL_GPIO_SetAFPin_0_7(GPIOA, LL_GPIO_PIN_8, LL_GPIO_AF_0);

    switch(mco_feq){
        case MCO_FREQ_1M:
            LL_RCC_ConfigMCO(LL_RCC_MCO1SOURCE_HSE, LL_RCC_MCO1_DIV_16);
            break;
        case MCO_FREQ_2M:
            LL_RCC_ConfigMCO(LL_RCC_MCO1SOURCE_HSE, LL_RCC_MCO1_DIV_8);
            break;
        case MCO_FREQ_4M:
            LL_RCC_ConfigMCO(LL_RCC_MCO1SOURCE_HSE, LL_RCC_MCO1_DIV_4);
            break;
        case MCO_FREQ_8M:
            LL_RCC_ConfigMCO(LL_RCC_MCO1SOURCE_HSE, LL_RCC_MCO1_DIV_2);
            break;
        case MCO_FREQ_16M:
            LL_RCC_ConfigMCO(LL_RCC_MCO1SOURCE_HSE, LL_RCC_MCO1_DIV_1);
            break;
        default:
            LL_RCC_ConfigMCO(LL_RCC_MCO1SOURCE_NOCLOCK, LL_RCC_MCO1_DIV_16);
            break;
    }
}

static void core_mco_disable(void){
	LL_GPIO_SetPinPull(GPIOA, LL_GPIO_PIN_8, LL_GPIO_PULL_NO);
    LL_GPIO_SetPinMode(GPIOA, LL_GPIO_PIN_8, LL_GPIO_MODE_ANALOG);

    LL_RCC_ConfigMCO(LL_RCC_MCO1SOURCE_NOCLOCK, LL_RCC_MCO1_DIV_16);
}

static void gps_pps_isr_handler(void *ctx){
    struct gps_domain_data_s * data_domain = (struct gps_domain_data_s *)ctx;
    data_domain->pps += 1;
}

static void gps_nmea_parse_zda_handler(uint8_t ch, void *ctx){
    /// $GNZDA,124729.000,30,05,2022,00,00*47\r\n\0
    gps_nmea_parse_zda_t *zda = (gps_nmea_parse_zda_t *)ctx;

    zda->sentence[zda->char_num++] = ch;
    if(zda->sentence[0] != '$'){
        zda->char_num = 0;
        return;
    }
    if((zda->char_num == 6) && (strncmp("ZDA", &zda->sentence[3], 3) != 0)){
        zda->char_num = 0;
        return;
    }
    if((zda->sentence[0] == '$') && (zda->sentence[zda->char_num - 2] == '\r') && (ch == '\n')){
        zda->sentence[zda->char_num] = '\0';
//        zda->parse = minmea_parse_zda(&zda->zda, zda->sentence);
        zda->parse = 1;
    }
}

static void gpio_dec5v_isr_handler(void *ctx){

}

static void gpio_dec5v_isr_install(GPIO_TypeDef * dec5VPort, int32_t dec5VPin, isr_function_handle_t fn, void *ctx){
    int gpio_num = -1, irqn = -255;
    GPIO_InitTypeDef GPIO_InitStructure = {
            .Alternate = 0,
            .Mode = GPIO_MODE_IT_RISING_FALLING | GPIO_MODE_INPUT,
            .Pin = 1UL << dec5VPin,
            .Pull = GPIO_PULLDOWN,
            .Speed = GPIO_SPEED_LOW,
    };
    if((dec5VPort == NULL) || (dec5VPin < 0)) return;
    HAL_GPIO_Init(dec5VPort, &GPIO_InitStructure);

    gpio_num = gpio_mask2num(dec5VPin);
    irqn = gpio_get_irqn(gpio_num);

    ll_gpio_exti_isr_install(gpio_num, fn, ctx);

    HAL_NVIC_SetPriority(irqn, 0, 0);
    HAL_NVIC_EnableIRQ(irqn);
}

static void gpio_dec5v_isr_uninstall(GPIO_TypeDef * dec5VPort, int32_t dec5VPin){
    int gpio_num = -1, irqn = -255;
    GPIO_InitTypeDef GPIO_InitStructure = {
            .Alternate = 0,
            .Mode = GPIO_MODE_ANALOG,
            .Pin = 1UL << dec5VPin,
            .Pull = GPIO_PULLDOWN,
            .Speed = GPIO_SPEED_LOW,
    };

    if((dec5VPort == NULL) || (dec5VPin < 0)) return;
    HAL_GPIO_Init(dec5VPort, &GPIO_InitStructure);
    gpio_num = (gpio_num_t)dec5VPin;
    irqn = gpio_get_irqn(gpio_num);
    HAL_NVIC_DisableIRQ(irqn);
    ll_gpio_exti_isr_uninstall(gpio_num);
}


static void analog_state_transition_action(void *currentStateData, struct event *event, void *newStateData);
static void read_cmd_uart_state_transition_action(void *currentStateData, struct event *event, void *newStateData);
static void gps_time_state_transition_action(void *currentStateData, struct event *event, void *newStateData);
static void idle_state_transition_action(void *currentStateData, struct event *event, void *newStateData);


static bool check_event(void *check_event, struct event *event);
static void entry_self_test_state_handler(void *state_data, struct event *event);

static void entry_idle_state_handler(void *state_data, struct event *event);
static void entry_read_cmd_uart_state_handler(void *state_data, struct event *event);
static void entry_parse_cmd_state_handler(void *state_data, struct event *event);
static void entry_gps_time_state_handler(void *state_data, struct event *event);
static void entry_analog_state_handler(void* state_data, struct event *event);
static void entry_analog_write_file_state_handler(void* state_data, struct event *event);
static void entry_error_state_handler(void* state_data, struct event *event);

static void exit_analog_write_file_sate_handler(void* state_data, struct event *event);
static void exit_gps_time_state_handler(void* state_data, struct event *event);

static struct state start_sate, self_test_state, idle_state, read_cmd_uart_state, parse_cmd_state, gps_time_state,  analog_state, analog_write_file_state, error_state;

static struct state start_sate = {
        .parentState = NULL,
        .entryState = &self_test_state,
        .transitions = (struct transition[]){
                {
                        eTYPE_SELF, NULL, NULL, NULL, &self_test_state,
                },
                {
                        eTYPE_NOEVENT, NULL, NULL, NULL, &idle_state,
                },
        },
        .numTransitions = 2,
        .entryAction = NULL,
        .exitAction = NULL,
        .data = &idle_data_domain,
};

