XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/Core/Src/main.c
static struct state self_test_state = {
        .parentState = &start_sate,
        .entryState = NULL,
        .transitions = (struct transition[]){
                {
                    eTYPE_SELF, NULL, NULL, NULL, &self_test_state,
                },
                {
                    eTYPE_NOEVENT, NULL, NULL, NULL, &idle_state,
                },
                {
                    eTYPE_ERROR, NULL, NULL, NULL, &error_state
                },
        },
        .numTransitions = 3,
        .entryAction = &entry_self_test_state_handler,
        .exitAction = NULL,
        .data = &idle_data_domain,
};

static struct state idle_state = {
        .parentState = &start_sate,
        .entryState = NULL,
        .transitions = (struct transition[]){
                {
                        eTYPE_ANALOG, (void*)(intptr_t)EVENT_ANALOG_BUFFER_FULL, &check_event, NULL, &analog_write_file_state,
                },
                {
                        eTYPE_ANALOG, NULL, NULL, &analog_state_transition_action, &analog_state,
                },
                {
                        eTYPE_CMD, (void*)(intptr_t)EVENT_UART2USB_DATA_READY, &check_event, NULL, &read_cmd_uart_state,
                },
                {     /// TODO 处理 USB 插入
                        eTYPE_USB, NULL, NULL, NULL, &idle_state,
                },
                {
                        eTYPE_SD, NULL, NULL, NULL, &idle_state,
                },
                {
                        eTYPE_GPS, NULL, NULL, gps_time_state_transition_action, &gps_time_state,
                },
                {
                        eTYPE_ERROR, NULL, NULL, NULL, &error_state,
                },
                {
                        eTYPE_NOEVENT, NULL, NULL, &idle_state_transition_action, &idle_state,
                },
        },
        .numTransitions = 8,
        .entryAction = &entry_idle_state_handler,
        .exitAction = NULL,
        .data = &idle_data_domain,
};

/*!> 读取串口数据 */
static struct state read_cmd_uart_state = {
        .parentState = &idle_state,
        .entryState = NULL,
        .transitions = (struct transition[]){
                {eTYPE_CMD, NULL, NULL, NULL, &parse_cmd_state},
                {eTYPE_NOEVENT, NULL, NULL, &idle_state_transition_action, &idle_state},
        },
        .numTransitions = 2,
        .entryAction = &entry_read_cmd_uart_state_handler,
        .exitAction = NULL,
        .data = &cmd_data_domain,
};

/*!> 命令解析状态 */
static struct state parse_cmd_state = {
        .parentState = &read_cmd_uart_state,
        .entryState = NULL,
        .transitions = (struct transition[]){
                {eTYPE_NOEVENT, NULL, NULL, &idle_state_transition_action, &idle_state},
        },
        .numTransitions = 1,
        .entryAction = &entry_parse_cmd_state_handler,
        .exitAction = NULL,
        .data = &cmd_data_domain,
};

/*!> GPS 授时状态 */
static struct state gps_time_state = {
        .parentState = &idle_state,
        .entryState = NULL,
        .transitions = (struct transition[]){
            {eTYPE_NOEVENT, NULL, NULL, &idle_state_transition_action, &idle_state},
        },
        .numTransitions = 1,
        .entryAction = &entry_gps_time_state_handler,
        .exitAction = &exit_gps_time_state_handler,
        .data = &gps_data_domain,
};

static struct state analog_state = {
        .parentState = &idle_state,
        .entryState = NULL,
        .transitions = (struct transition[]){
            {eTYPE_ANALOG, (void *)(intptr_t)(EVENT_ANALOG_BUFFER_FULL), &check_event, NULL, &analog_write_file_state},
            {eTYPE_NOEVENT, NULL, NULL, &idle_state_transition_action, &idle_state},
        },
        .numTransitions = 2,
        .entryAction = &entry_analog_state_handler,
        .exitAction = NULL,
        .data = &analog_data_domain,
};

/*!> 采样数据写入文件 */
static struct state analog_write_file_state = {
        .parentState = &analog_state,
        .entryState = NULL,
        .transitions = (struct transition[]){
                {eTYPE_NOEVENT, NULL, NULL, &idle_state_transition_action, &idle_state},
        },
        .numTransitions = 1,
        .entryAction = &entry_analog_write_file_state_handler,
        .exitAction = NULL,
        .data = &analog_data_domain,
};

/*!> 错误状态 */
static struct state error_state = {
        .parentState = &idle_state,
        .entryState = NULL,
        .transitions = (struct transition[]){
                {eTYPE_NOEVENT, NULL, NULL, NULL, &idle_state},
        },
        .numTransitions = 1,
        .entryAction = &entry_error_state_handler,
        .exitAction = NULL,
        .data = &idle_data_domain,
};

static struct event fsm_event = {
        .type = eTYPE_SELF,
        .data = 0,
};

struct stateMachine fsm = {
        .currentState = NULL,
        .previousState = NULL,
        .errorState = NULL,
};

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */

int main(void){
    /* USER CODE BEGIN 1 */
    uint32_t err = 0;
    /* USER CODE END 1 */
    if(1){  /// \brief 等待供电稳定
        uint32_t _system_clock_count = 8000000;
        while(_system_clock_count--);
    }

    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();
    gpio_all_set_analog();
    rtc_initialize(NULL);
    SystemClockHSE_Config(SYS_CORE_FREQ_72M);
    HAL_Init();
    mem_dma_init();

    gpio_output_initialize();
    gpio_input_initialize();

    gps_pps_isr_install(IO_PPS_PORT, IO_PPS_PIN, &gps_pps_isr_handler, &gps_data_domain);

    ll_peripheral_isr_install(PVD_PVM_IRQn, &pvd_pvm_isr_handler, &sys_fild);  /// \brief 注册PVD 回调函数

    core_iwdg_initialize(30000);
    /// \brief 进入有限状态机
    /// TODO FSM 变换
#if(0)
    if(0){
        UART_HandleTypeDef  *cmd_uart_handle = NULL;
//        usart1_initialize(&cmd_uart_handle, 921600);
//        usart1_write_bytes(cmd_uart_handle, "test\n", 5, 100);

