XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/Core/Src/main.c
        gps_pps_isr_install(IO_PPS_PORT, IO_PPS_PIN, gps_pps_isr_handler, NULL);
        gps_pps_irq_disable();
//        while(gpio_get_pps_level() == 0);
        gps_time_state_transition_action(&idle_data_domain, NULL, &gps_data_domain);

        while(1){
            while(gpio_get_pps_level() == 0);
            gps_nmea_parse_zda_t zda = {.sentence = {'\0'}, .char_num = 0, .parse = 0,};
            lpuart1_install_char_process_handler(&gps_nmea_parse_zda_handler, &zda);
            lpuart1_start_receive(NULL);
        	while(zda.parse == 0);
            lpuart1_stop_receive(NULL);
            lpuart1_install_char_process_handler(NULL, NULL);
//            HAL_Delay(1000);
        };
    }
    if(0){
        UART_HandleTypeDef *uart1_handle = NULL;
        usart1_initialize(&uart1_handle, 9600);

        const uint8_t test_tx[] = {'T', 'E', 'S', 'T', ' ', 'U', 'A', 'R', 'T', '\n'};
        usart1_write_bytes(uart1_handle, (void*)test_tx, sizeof(test_tx), 1000);
        usart1_start_receive(uart1_handle);
        while(1){
            uint8_t test[128], tl = 0;
            tl = usart1_read_bytes(uart1_handle, test, 128, 1000);
            if(tl) usart1_write_bytes(uart1_handle, test, tl, 1000);
        }
    }
    if(0){
        UART_HandleTypeDef *lpuart1_handle = NULL;
        lpuart1_initialize(&lpuart1_handle, 9600);

        lpuart1_start_receive(lpuart1_handle);
        while(1){
            uint8_t test[1024], tl = 0;
//            tl = lpuart1_read_bytes(lpuart1_handle, test, 1024, 1000);
            UNUSED(tl);
        }
    }
    if(0){
        SD_HandleTypeDef *sd_handle = NULL;
        int err = 0;
        err = sdmmc_initialize(&sd_handle);
        HAL_Delay(100);

    }
    if(0){
        FATFS * fs = NULL;
        FIL ads_data_file;
        int err = 0;
        err = FATFS_SD_Init(&fs);
#if(0)
        err = f_mount(&fatfs, sd_root_path, 0);
        if(!err){
            err = f_open(file, "0:/test.txt", FA_WRITE | FA_CREATE_ALWAYS);
        }
        f_close(file);
#endif
        FS_FileOperations();
        err = f_open(&ads_data_file, "data.bin", FA_CREATE_ALWAYS | FA_WRITE);
        if(err != FR_OK){
            while(1){
                HAL_Delay(1000);
            }
        }
    }

    if(0){
        SPI_HandleTypeDef *spi1_handle = NULL;
        st_spi1_init(&spi1_handle);
        ads127_bsp_reset_pin_initial(GPIOC, 4);
        ads127_bsp_start_pin_initial(GPIOC, 5);

        ads127_bsp_reset();
        ads127_driver_initialize(spi1_handle, GPIOA, 4);
        if(0){
            ads127_dev_t device = {
                    0
            };
            ads127_get_id(&device);
            ads127_get_id(&device);
            ads127_get_mode(&device);
            HAL_Delay(100);
        }
        if(0){
            ads127_dev_t device = {
                    .config.val = 0x00,
            };
            uint32_t ret = 0;
            ads127_configure(&device);
            device.config.val = 0;
            ret = ads127_get_configure(&device);
            HAL_Delay(ret);
        }
        if(0){
            ads127_dev_t device = {
                    .ofc.val = 0x00112233,
            };
            ads127_configure_ofc(&device);
            device.ofc.val = 0;
            ads127_get_ofc(&device);
            HAL_Delay(100);
        }
        if(0){
            ads127_dev_t device = {
                    .fsc.val = 0x1122,
            };
            ads127_configure_fsc(&device);
            device.fsc.val = 0;
            ads127_get_fsc(&device);
            HAL_Delay(100);
        }
        HAL_Delay(100);

        ads127_dev_t device = ADS127_DEFAULT_DEVICE();
        ads127_get_id(&device);
        ads127_get_mode(&device);
        ads127_get_configure(&device);
        ads_data_init_t read_init = {
                .config = 0,
                .clk = MCO_FREQ_16M,
        };
        read_init.config.val = device.config.val;
        ads127_bsp_read_init(&read_init, NULL, NULL);
        ads127_bsp_drdy_isr_install(GPIOB, 1, ads127_bsp_read_data_from_isr, spi1_handle);
        ads127_bsp_enable_drdy();
        ads127_bsp_start();
    }

#endif

    stateM_init(&fsm, &start_sate, &error_state);
    /* USER CODE END Init */

    /* Configure the system clock */
    idle_data_domain.start_tick = HAL_GetTick();
    while(1){
        if((!sys_fild.analog) && sys_fild.self_test){
            uint32_t tick = HAL_GetTick();
            struct state *cs = NULL;
            cs = stateM_currentState(&fsm);
            if(((tick - idle_data_domain.start_tick) > (10 * 1000)) && (cs == &idle_state)){
                sys_fild.analog = 1;
                fsm_event.type = eTYPE_ANALOG;
            }
        }
        stateM_handleEvent(&fsm, &fsm_event);
        core_iwdg_refresh();
    }
    /* USER CODE END SysInit */
    NVIC_SystemReset();
    /* Initialize all configured peripherals */

    /* USER CODE BEGIN 2 */


    /* USER CODE END 2 */

    /* Infinite loop */
    /* USER CODE BEGIN WHILE */
    while (1)
    {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    }
    /* USER CODE END 3 */
    return 0;
}


/* USER CODE BEGIN 4 */

/**
 *
 */

void SystemClockHSE_Config(SYS_Core_Freq_t in_clk_freq){
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};

    LL_FLASH_SetLatency(LL_FLASH_LATENCY_1);
    while(LL_FLASH_GetLatency()!= LL_FLASH_LATENCY_1){};
    LL_PWR_SetRegulVoltageScaling(LL_PWR_REGU_VOLTAGE_SCALE1);

    /* -1- Select MSI as system clock source to allow modification of the PLL configuration */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_MSI;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1) != HAL_OK) return;
    /* -2- Enable HSE  Oscillator, select it as PLL source and finally activate the PLL */
    RCC_OscInitStruct.OscillatorType        = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState              = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLSource         = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLState          = RCC_PLL_ON;

    if(in_clk_freq == SYS_CORE_FREQ_32M){
      RCC_OscInitStruct.PLL.PLLM              = 2;  // 16M / M
      RCC_OscInitStruct.PLL.PLLN              = 16; // 16 / M * N
      RCC_OscInitStruct.PLL.PLLP              = 7;
      RCC_OscInitStruct.PLL.PLLQ              = 4;
      RCC_OscInitStruct.PLL.PLLR              = 4;
    //		  RCC_OscInitStruct.PLL.PLLSource         = RCC_PLLSOURCE_HSE;
    //		  RCC_OscInitStruct.PLL.PLLState          = RCC_PLL_ON;
    }
    if(in_clk_freq == SYS_CORE_FREQ_36M){
        RCC_OscInitStruct.PLL.PLLM              = 2;  // 16M / M
        RCC_OscInitStruct.PLL.PLLN              = 36; // 16 / M * N
        RCC_OscInitStruct.PLL.PLLP              = 7;
        RCC_OscInitStruct.PLL.PLLQ              = 6;
        RCC_OscInitStruct.PLL.PLLR              = 8;
        //		  RCC_OscInitStruct.PLL.PLLSource         = RCC_PLLSOURCE_HSE;
        //		  RCC_OscInitStruct.PLL.PLLState          = RCC_PLL_ON;
    }
    if(in_clk_freq == SYS_CORE_FREQ_48M){
      RCC_OscInitStruct.PLL.PLLM              = 2;  // 16M / M
      RCC_OscInitStruct.PLL.PLLN              = 36; // 16 / M * N
      RCC_OscInitStruct.PLL.PLLP              = 7;
      RCC_OscInitStruct.PLL.PLLQ              = 6;
      RCC_OscInitStruct.PLL.PLLR              = 6;
    //		  RCC_OscInitStruct.PLL.PLLSource         = RCC_PLLSOURCE_HSE;
    //		  RCC_OscInitStruct.PLL.PLLState          = RCC_PLL_ON;
    }
    if(in_clk_freq == SYS_CORE_FREQ_64M){
        RCC_OscInitStruct.PLL.PLLM              = 2;  // 16M / M
        RCC_OscInitStruct.PLL.PLLN              = 16; // 16 / M * N
        RCC_OscInitStruct.PLL.PLLP              = 7;
        RCC_OscInitStruct.PLL.PLLQ              = 4;
        RCC_OscInitStruct.PLL.PLLR              = 2;
        //		  RCC_OscInitStruct.PLL.PLLSource         = RCC_PLLSOURCE_HSE;
        //		  RCC_OscInitStruct.PLL.PLLState          = RCC_PLL_ON;
    }
    if(in_clk_freq == SYS_CORE_FREQ_72M){
        RCC_OscInitStruct.PLL.PLLM              = 2;  // 16M / M
        RCC_OscInitStruct.PLL.PLLN              = 36; // 16 / M * N
        RCC_OscInitStruct.PLL.PLLP              = 7;
        RCC_OscInitStruct.PLL.PLLQ              = 6;
        RCC_OscInitStruct.PLL.PLLR              = 4;
        //		  RCC_OscInitStruct.PLL.PLLSource         = RCC_PLLSOURCE_HSE;
        //		  RCC_OscInitStruct.PLL.PLLState          = RCC_PLL_ON;
    }
    if(in_clk_freq == SYS_CORE_FREQ_80M){
        RCC_OscInitStruct.PLL.PLLM              = 2;  // 16M / M
        RCC_OscInitStruct.PLL.PLLN              = 20; // 16 / M * N
        RCC_OscInitStruct.PLL.PLLP              = 7;
        RCC_OscInitStruct.PLL.PLLQ              = 4;
        RCC_OscInitStruct.PLL.PLLR              = 2;
        //		  RCC_OscInitStruct.PLL.PLLSource         = RCC_PLLSOURCE_HSE;
        //		  RCC_OscInitStruct.PLL.PLLState          = RCC_PLL_ON;
    }
    if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK){
    /* Initialization Error */
//        Error_Handler();
    }

    /* -3- Select the PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 clocks dividers */
    RCC_ClkInitStruct.ClockType       = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
//    if(READ_BIT(RCC->CR, RCC_CR_PLLRDY)) RCC_ClkInitStruct.SYSCLKSource    = RCC_SYSCLKSOURCE_PLLCLK;
//    else{
//      RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
//    }
    RCC_ClkInitStruct.SYSCLKSource    = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider   = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider  = RCC_HCLK_DIV1;
    RCC_ClkInitStruct.APB2CLKDivider  = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
    {
    /* Initialization Error */
//    Error_Handler();
    }

