XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/Core/Src/main.c
    /* -4- Optional: Disable MSI Oscillator (if the MSI is no more needed by the application)*/
    RCC_OscInitStruct.OscillatorType  = RCC_OSCILLATORTYPE_MSI;
    RCC_OscInitStruct.MSIState        = RCC_MSI_OFF;
    RCC_OscInitStruct.PLL.PLLState    = RCC_PLL_NONE;  /* No update on PLL */
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
    {
    /* Initialization Error */
//    Error_Handler();
    }

    HAL_Init();
}

void Clock48_Domain_Cofing(void){
#if(0)
	RCC_PLLSAI1InitTypeDef PllSAI1ClkInit = {0};
	PllSAI1ClkInit.PLLSAI1ClockOut = RCC_PLLSAI1_48M2CLK;
	PllSAI1ClkInit.PLLSAI1M = 2;
	PllSAI1ClkInit.PLLSAI1N = 12;
	PllSAI1ClkInit.PLLSAI1P = RCC_PLLP_DIV7;
	PllSAI1ClkInit.PLLSAI1Q = RCC_PLLQ_DIV2;
	PllSAI1ClkInit.PLLSAI1R = RCC_PLLR_DIV2;
	PllSAI1ClkInit.PLLSAI1Source = RCC_PLLSOURCE_HSE;

	if(HAL_RCCEx_EnablePLLSAI1(&PllSAI1ClkInit) != HAL_OK){
		Error_Handler();
	}
#endif
}

void RTCClockLSE_Config(void){
#if(1)
    LL_APB1_GRP1_EnableClock(LL_APB1_GRP1_PERIPH_PWR);
	LL_PWR_EnableBkUpAccess();
	uint32_t _timeout = 0;
    if(LL_RCC_LSE_IsReady() == 0){   // 防止重复初始化
    	_timeout = SystemCoreClock;
        LL_RCC_ForceBackupDomainReset();
        LL_RCC_ReleaseBackupDomainReset();
		LL_RCC_LSE_EnableBypass();
		LL_RCC_LSE_Enable();
		/* Wait till LSE is ready */
		while((LL_RCC_LSE_IsReady() != 1) && (_timeout--)){};
		LL_RCC_ClearFlag_LSERDY();
//		LL_RCC_LSE_EnableCSS();
		if((!_timeout) && (LL_RCC_LSE_IsReady() != 1)){
			LL_RCC_LSI_Enable();
			LL_RCC_LSE_Disable();
			while(LL_RCC_LSI_IsReady() != 1);
		}else{
			LL_RCC_LSI_Disable();
		}
    }
#else
    RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};
    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_RTC;
    PeriphClkInit.RTCClockSelection = RCC_RTCCLKSOURCE_LSE;
    if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK){
        Error_Handler();
    }

#endif
}

static void pvd_pvm_isr_handler(void *ctx){

    /* Check PWR exti flag */
    if(__HAL_PWR_PVD_EXTI_GET_FLAG() != 0x0U){
        uint32_t pvdo = 0;
        pvdo = __HAL_PWR_GET_FLAG(PWR_FLAG_PVDO);

        if(pvdo && ctx){
            system_fild_t *fild = (system_fild_t *)ctx;
            fild->pvd_below = 1;
        }
        /* Clear PVD exti pending bit */
        __HAL_PWR_PVD_EXTI_CLEAR_FLAG();
    }
}

static void read_cmd_uart_state_transition_action(void *currentStateData, struct event *event, void *newStateData){
    UNUSED(currentStateData);
    UNUSED(event);
    struct cmd_domain_data_s * data_domain = (struct cmd_domain_data_s *)newStateData;
    if(data_domain->cmd_uart_handle == NULL){
        usart1_initialize(&data_domain->cmd_uart_handle, data_domain->sys_config->system.uart_baudrate);
        usart1_start_receive(data_domain->cmd_uart_handle);
    }
}


static void idle_state_transition_action(void *currentStateData, struct event *event, void *newStateData){
    UNUSED(currentStateData);
    UNUSED(newStateData);
    struct idle_domain_data_s * data_domain = (struct idle_domain_data_s *)newStateData;
    event->type = eTYPE_NOEVENT;
    if(data_domain->fild->pvd_below){
        event->type = eTYPE_ERROR;
        goto return_section;
    }
    if(gpio_get_pps_level()){
        event->type = eTYPE_GPS;
        goto return_section;
    }

    if(ads127_bsp_availablle(NULL) > 0){
        event->type = eTYPE_ANALOG;
        goto return_section;
    }

    if(usart1_bytes_available(data_domain->cmd_domain->cmd_uart_handle)){
        event->type = eTYPE_CMD;
        goto return_section;
    }

    if(gpio_cmd_detect()){
        event->type = eTYPE_USB;
        goto return_section;
    }

    return_section:
    return;
}

static void gps_time_state_transition_action(void *currentStateData, struct event *event, void *newStateData){
    UNUSED(currentStateData);
    UNUSED(event);

    struct gps_domain_data_s * data_domain = (struct gps_domain_data_s *)newStateData;
    struct idle_domain_data_s * idle_domain = (struct idle_domain_data_s *)currentStateData;

    if((data_domain->gps_uart_handle == NULL)){
        lpuart1_initialize(&data_domain->gps_uart_handle, data_domain->sys_config->gps.baudrate);
    }else{
#if(0)
        if(lpuart1_is_start_receive(data_domain->gps_uart_handle) == false){
            lpuart1_start_receive(data_domain->gps_uart_handle);  /// 开始 接收
        }
#else

#endif
    }
    if(ads127_bsp_is_start()){     /// 检查采样情况
        ads127_bsp_stop();
        core_mco_disable();
        if(ads127_bsp_availablle(NULL)){
            ads127_bsp_write_file(&idle_domain->analog_domain->ads_data_file);
            f_close(&idle_domain->analog_domain->ads_data_file);
        }
    }
    idle_domain->fild->analog = 0;
    gpio_buzzer_off();
}

static void analog_state_transition_action(void *currentStateData, struct event *event, void *newStateData){
    if(stateM_currentState(&fsm) == &idle_state){
        struct idle_domain_data_s * idle_domain = (struct idle_domain_data_s *)currentStateData;

        if(idle_domain->gps_domain->gps_uart_handle){
            lpuart1_stop_receive(idle_domain->gps_domain->gps_uart_handle);
            lpuart1_deinitialize(&idle_domain->gps_domain->gps_uart_handle);
        }
        if(idle_domain->cmd_domain->cmd_uart_handle){
            usart1_stop_receive(idle_domain->cmd_domain->cmd_uart_handle);
            usart1_deinitialize(&idle_domain->cmd_domain->cmd_uart_handle);
        }
    }
}

static bool check_event(void *check_event, struct event *event){
    system_event_def_t check = (system_event_def_t)(void *)(intptr_t)check_event;
    bool ret = false;

    if(event->type == eTYPE_ANALOG){
        switch(check){
            case EVENT_ANALOG_BUFFER_FULL:
                if(ads127_bsp_availablle(NULL) > 0) ret = true;
                break;
            case EVENT_ANALOG_STOP:
                ret = ads127_bsp_is_start();
                ret = !ret;
                break;
            default:
                ret = false;
                break;
        }
    }else if(event->type == eTYPE_USB){
        struct cmd_domain_data_s *handle = (struct cmd_domain_data_s *)event->data;
        switch(check){
            case EVENT_UART2USB_DATA_READY:
                if(usart1_bytes_available(NULL)) ret = true;
                break;
            case EVENT_UART2USB_CONNECT:
                if(handle->cmd_uart_handle == NULL) ret = true;
                break;
            case EVENT_UART2USB_DISCONNECT:
                if(handle->cmd_uart_handle) ret = true;
                break;
            default:
                ret = false;
                break;
        }
    }else if(event->type == eTYPE_GPS){
        switch(check){
            case EVENT_GPS_PPS:
                if(gpio_get_pps_level()) ret = true;
                break;
            default:
                ret = false;
                break;
        }
    }else if(event->type == eTYPE_SD){
        switch(check){
            case EVENT_SD_CONNECT:
                break;
            case EVENT_SD_DISCONNECT:
                break;
            default:
                ret = false;
                break;
        }
    }else if(event->type == eTYPE_ERROR){
        ret = true;
    }else{
        ret = false;
    }
    return ret;
}

