XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/Core/Src/main.c
static void entry_self_test_state_handler(void *state_data, struct event *event){

    struct idle_domain_data_s * data_domain = (struct idle_domain_data_s *)state_data;
    int err = 0;

    data_domain->fild->self_test = 0;
//    gpio_buzzer_on();

    ads127_bsp_reset_pin_initial(IO_ADS_RESET_PORT, IO_ADS_RESET_PIN);
    ads127_bsp_start_pin_initial(IO_ADS_START_PORT, IO_ADS_START_PIN);

    gpio_ts3a_mcu();

    /* USER CODE BEGIN Init */

    if(0){
        rtc_date_time_t time = { 0 };
        st_rtc_get_time_v2(&time);
    }

    if(gpio_sd_detect()){   /*!< 检测 SD 卡 */
        uint32_t timeout = 30000, start_tick = 0, tick = 0;
        start_tick = HAL_GetTick();
        tick = start_tick;
        do{
            if(gpio_sd_detect() == 0){
                HAL_Delay(1000);
                if(gpio_sd_detect() == 0){
                    gpio_buzzer_off();
                    break;
                }
            }
            tick = HAL_GetTick();
            if(((tick - start_tick) % 500) == 0) gpio_buzzer_toggle();
        }while((tick - start_tick < timeout));
        if((tick - start_tick >= timeout)){
            gpio_buzzer_off();
            core_enter_power_mode(LL_PWR_MODE_SHUTDOWN);
        }
        while(1);
    }
    err = FATFS_SD_Init(&sd_fs_handle);  /// \brief 挂载 SD
    if(err){
        gpio_buzzer_on();
        HAL_Delay(5000);
        gpio_buzzer_off();
        HAL_NVIC_SystemReset();
        while(1);
    }
    log_file_create(NULL, NULL);   /// 在默认位置创建日志文件

    if(1){  /// \brief 检测 Analog 采样 ADS127L01
        analog_data_domain.clk = MCO_FREQ_16M;
        ads127_bsp_stop();
        core_mco_enable(analog_data_domain.clk);
        st_spi1_init(&analog_data_domain.ads_spi_handle[0]);
        ads127_bsp_reset();
        ads127_driver_initialize(analog_data_domain.ads_spi_handle[0], IO_ADS_CS_PORT , IO_ADS_CS_PIN);
        uint32_t device_id = 0;
        device_id = ads127_get_id(&analog_data_domain.device);
        ads127_configure(&analog_data_domain.device);
        if(device_id & 0x03){
            log_printf("检测到 ADC Chip, 设备ID: %#x. \n", device_id);
            core_mco_disable();
        }else{
            log_printf("无法检测 ADC Chip! \n");
            gpio_buzzer_on();
            HAL_Delay(5000);
            gpio_buzzer_off();
            log_file_close();
            HAL_GPIO_WritePin(IO_ADS_RESET_PORT, PIN_MASK(IO_ADS_RESET_PIN), 0);
            core_mco_disable();
            HAL_NVIC_SystemReset();
            while(1);
        }
    }
    /// \brief 自检通过
    if(0){
        uint32_t timeout = 30000, tick = 0, start_tick = 0;
        start_tick = HAL_GetTick();
        tick = start_tick;
        do{
            if(gpio_cmd_detect()){
                /// TODO 检测到 USB 插入, DoSomething
            }
            tick = HAL_GetTick();
            if(tick - start_tick >= timeout){
                /// TODO 没有检测到 USB 插入, DoSomething
            }
        }while(tick - start_tick < timeout);
    }
    log_printf("系统自检通过.\n");
    data_domain->fild->self_test = 1;      /// 自检通过
    event->type = eTYPE_NOEVENT;
}

static void entry_idle_state_handler(void *state_data, struct event *event){
    idle_state_transition_action(state_data, event, state_data);
}

static void entry_read_cmd_uart_state_handler(void *state_data, struct event *event){
    struct cmd_domain_data_s *data_domain = (struct cmd_domain_data_s *)state_data;
    uint8_t *buffer = NULL;
    uint16_t rb = 0;
    rb = usart1_bytes_available(data_domain->cmd_uart_handle);
    if(!rb) return;
    buffer = (uint8_t *)malloc(rb + 1);
    rb = usart1_read_bytes(data_domain->cmd_uart_handle, buffer, rb + 1, 0);

    cmd_data_frame_handle handle = (cmd_data_frame_handle)buffer;

    free(buffer);
    event->type = eTYPE_NOEVENT;
}

static void entry_parse_cmd_state_handler(void *state_data, struct event *event){
    UNUSED(state_data);
    event->type = eTYPE_NOEVENT;
}

static void entry_gps_time_state_handler(void *state_data, struct event *event){
#define NMEA_BUFFER_SIZE               100
    struct gps_domain_data_s *data_domain = (struct gps_domain_data_s *)state_data;
#if(0)
    char buf[NMEA_BUFFER_SIZE + 1] = {'\0'}, nmea_zda[NMEA_BUFFER_SIZE] = {'\0'};
    int sfild = -1, pfild = -1, rb = 0, ni = 0;
    struct minmea_sentence_zda zda = { 0 };
#else
    gps_nmea_parse_zda_t zda_parse = {.sentence = {'\0'}, .char_num = 0, .parse = 0, .zda = {{0}, {0}, 0, 0}};
#endif
    char ok = 0;
    int parse_res = 0;
    uint32_t tick = 0, start_tick = 0, pps = 0;

    rtc_date_time_t time = { 0 };
    uint32_t bcd_time = 0x00000000, bcd_date = 0x00002101;
    u32_st_rtc_time_bcd_format_handle bcd_time_handle = NULL;
    u32_st_rtc_date_bcd_format_handle bcd_date_handle = NULL;

    bcd_time_handle = (u32_st_rtc_time_bcd_format_handle)&bcd_time;
    bcd_date_handle = (u32_st_rtc_date_bcd_format_handle)&bcd_date;

    /// NMEA报文在 PPS 脉冲上升沿前发送完毕
#if(0)

#else
    lpuart1_install_char_process_handler(&gps_nmea_parse_zda_handler, &zda_parse);
    lpuart1_start_receive(data_domain->gps_uart_handle);  /// 开始 接收
#endif
    LL_RTC_DisableWriteProtection(RTC);
    st_rtc_enter_initmode();

    start_tick = HAL_GetTick();
    tick = start_tick;

    do{
        tick = HAL_GetTick();
    }while(gpio_get_pps_level() && ((tick - start_tick) <= 500)); /// 等待 PPS 信号变低, PPS 宽度 100ms
    if((tick - start_tick) > 500) goto end_section;
    pps = data_domain->pps;
#if(0)
    do{
        rb = lpuart1_read_bytes(data_domain->gps_uart_handle, buf, NMEA_BUFFER_SIZE, 500);   /// 读取 NMEA 数据
        if(!rb) break;
        buf[rb] = '\0';
        for(int i = 0; i < rb; i++){
            if(sfild == -1){
                if((buf[i] == '$') && (strncmp("ZDA", &buf[i + 3], 3) == 0)){
                    sfild = i;
                    strncpy(nmea_zda, &buf[i], 6);
                    ni += 6;
                }
            }else{
                nmea_zda[ni++] = buf[i];
                if((buf[i] == '\n') && (buf[i - 1] == '\r')){
                    pfild = i;
                    break;
                }
            }
        }
    }while(pfild <= 0);

    lpuart1_stop_receive(data_domain->gps_uart_handle);

    if((sfild < 0) || (pfild < 0)) goto end_section;
    nmea_zda[ni + 1] = '\0';
#else

    start_tick = HAL_GetTick();
    tick = start_tick;
    do{
        tick = HAL_GetTick();
    }while((zda_parse.parse == 0) && ((tick - start_tick) <= 1500));

    lpuart1_stop_receive(data_domain->gps_uart_handle);
    lpuart1_install_char_process_handler(NULL, NULL);

    if((tick - start_tick) > 1500) goto end_section;

    parse_res = (int)minmea_parse_zda(&zda_parse.zda, zda_parse.sentence);

#endif

    if(!parse_res) goto end_section;

    time.time.ssecond = zda_parse.zda.time.microseconds;
    time.time.second = zda_parse.zda.time.seconds;
    time.time.minute = zda_parse.zda.time.minutes;
    time.time.hour = zda_parse.zda.time.hours;  /// XXX:进位到小时结束, 天数进位可能性太小, 不继续进位了, 权当隐藏 BUG
    time.time.hour += 8;
    time.date.day = zda_parse.zda.date.day;
    time.date.month = zda_parse.zda.date.month;
    time.date.year = zda_parse.zda.date.year;

//    if(gpio_get_pps_level() == 0){
//        while(gpio_get_pps_level() == 0);
//    }
//    while(gpio_get_pps_level() == 1);

//    rtc_add_seconds(&time, data_domain->pps - pps + 1);

    bcd_time_handle->sec = __LL_RTC_CONVERT_BIN2BCD(time.time.second);
    bcd_time_handle->min = __LL_RTC_CONVERT_BIN2BCD(time.time.minute);
    bcd_time_handle->hour = __LL_RTC_CONVERT_BIN2BCD(time.time.hour);
    bcd_time_handle->pm = 0;  /// 24 小时制

    bcd_date_handle->day = __LL_RTC_CONVERT_BIN2BCD(time.date.day);
    bcd_date_handle->wdu = __LL_RTC_CONVERT_BIN2BCD(time.date.weekday);
    bcd_date_handle->mon = __LL_RTC_CONVERT_BIN2BCD(time.date.month);
    bcd_date_handle->year = __LL_RTC_CONVERT_BIN2BCD(time.date.year - 2000);

    gps_pps_irq_disable(); /// 停止响应 PPS IRQ

    if((gpio_get_pps_level() == 0)){
        while(gpio_get_pps_level() == 0);  /// 等待当前时间 PPS 脉冲
    }

