XiaoSenLuo/STM32L476Rx_Core_FW_V1.15.1_V2/Core/Src/main.c
    RTC->TR = bcd_time;
    RTC->DR = bcd_date;
    ok = 1;
    end_section:
    st_rtc_exit_initmode();
    LL_RTC_EnableWriteProtection(RTC);

    if(ok){
        FIL time_file = { 0 };
        gpio_buzzer_on();
        int err = f_open(&time_file, TIME_FILE_PATH, FA_WRITE | FA_OPEN_ALWAYS | FA_OPEN_APPEND);
        if((err == FR_OK) || (err == FR_EXIST)){
            char buf[32] = {'\0'};
            err = rtc_time2str(&time, buf, 64);
            buf[err++] = '\n';
            f_write(&time_file, zda_parse.sentence, zda_parse.char_num, NULL);
            f_write(&time_file, buf, err, NULL);
            f_close(&time_file);
        }
        HAL_Delay(10000);
        gpio_buzzer_off();
    }
    gps_pps_irq_enable();
    event->type = eTYPE_NOEVENT;
#undef NMEA_BUFFER_SIZE
}

static void entry_analog_state_handler(void* state_data, struct event *event){

    if(event->type != eTYPE_ANALOG) return;
    if(ads127_bsp_is_start()) return;

    struct analog_domain_data_s * data_domain = (struct analog_domain_data_s *)state_data;
    ads_data_init_t init = { 0 };
    uint32_t err = 0, ds = 0, rate = 0, osr = 256;
    char name[64] = { '\0' };

    if(data_domain->ads_spi_handle[0] == NULL){
        st_spi1_init(&data_domain->ads_spi_handle[0]);
    }

    if(data_domain->ads_data_file.obj.fs){
        f_close(&data_domain->ads_data_file);
    }
    err = ads127_bsp_create_file(&data_domain->ads_data_file, &data_domain->file_create_time);
    if((err != FR_OK) && (err != FR_EXIST)){
        ads127_bsp_stop();
        core_mco_disable();
        fs_error_string(name, sizeof(name), err);
        log_printf("无法创建采样数据文件, 停止采样.[ERROR:%s]\n", name);
        gpio_buzzer_on();
        HAL_Delay(3000);
        gpio_buzzer_off();
        HAL_NVIC_SystemReset();
        return;
    }
    ds = rtc_time2str(&data_domain->file_create_time, name, sizeof(name));
    strncpy(&name[ds], ".bin", sizeof(name) - ds);
    log_printf("采样数据文件 %s 创建成功\n", name);

    init.clk = data_domain->clk;
    init.config.val = data_domain->device.config.val;
    init.mode.val = data_domain->device.mode.val;
    ads127_bsp_read_init(&init, NULL, NULL);

    osr = ads127_get_osr(&data_domain->device);
    osr = (osr != -1) ? osr : 256;
    rate = (data_domain->clk) / osr;
    data_domain->th = data_domain->sys_config->ads.ctrl.file.limit_type ? (data_domain->sys_config->ads.ctrl.file.limit << 10) : (rate * 4 * data_domain->sys_config->ads.ctrl.file.limit);   /// 计算文件限制大小

    ads127_bsp_drdy_isr_install(IO_ADS_DRDY_PORT, IO_ADS_DRDY_PIN, ads127_bsp_read_data_from_isr, data_domain->ads_spi_handle[0]);
    core_mco_enable(data_domain->clk);
    ads127_bsp_start();

    if(!ads127_bsp_availablle(NULL)){
        event->type = eTYPE_NOEVENT;
    }
    data_domain->fild->buzzer = 1;
    data_domain->buzzer_number = ANALOG_BUZZER_NUMBER;
}

static void entry_analog_write_file_state_handler(void* state_data, struct event *event){
    struct analog_domain_data_s *data_domain = (struct analog_domain_data_s *)state_data;
    uint32_t bl = 0, err = 0;
//    bl = ads127_bsp_availablle(NULL);
//    if(bl){
        err = ads127_bsp_write_file(&data_domain->ads_data_file);
        if(err){
            data_domain->error = err;
            data_domain->err_counter += 1;
            gpio_buzzer_toggle();
            if(data_domain->err_counter > 125){
                event->type = eTYPE_ERROR;
                return;
            }
        }else{
            data_domain->error = 0;
            if(data_domain->err_counter) data_domain->err_counter -= 1;
        }
        exit_analog_write_file_sate_handler(state_data, event);
//    }
//    idle_state_transition_action(state_data, event, idle_state.data);
    event->type = eTYPE_NOEVENT;
}

static void entry_error_state_handler(void* state_data, struct event *event){
    struct idle_domain_data_s * data_domain = (struct idle_domain_data_s *)state_data;
    if(event->type != eTYPE_ERROR) return;

    if(data_domain->fild->pvd_below){
        if(ads127_bsp_is_start()){
            ads127_bsp_stop();
            core_mco_disable();
            f_close(&data_domain->analog_domain->ads_data_file);
        }
        log_printf("电池电压不足, 系统关机\n");
        log_file_close();
        core_enter_power_mode(LL_PWR_MODE_SHUTDOWN);
        while(1);
    }
    if(stateM_previousState(&fsm) == (&analog_write_file_state)){
        char *err_str = NULL;
        err_str = fs_error_string(NULL, NULL, data_domain->analog_domain->error);
        log_printf("模拟采样发生错误[ERROR:%s]\n", err_str);
        log_printf("即将重启设备\n");
        log_file_close();
        f_close(&data_domain->analog_domain->ads_data_file);
    }else{
        log_printf("状态机运行发生错误, 前状态为 %#X \n.", (uint32_t)stateM_previousState(&fsm));
        log_printf("即将重启设备\n");
        log_file_close();
        f_close(&data_domain->analog_domain->ads_data_file);
    }
    HAL_NVIC_SystemReset();
    event->type = eTYPE_NOEVENT;
    while(1);
}

static void exit_analog_write_file_sate_handler(void* state_data, struct event *event){
    struct analog_domain_data_s *data_domain = (struct analog_domain_data_s *)state_data;
    uint64_t file_size = 0;

    char name[64] = { '\0' };
    uint32_t ds = 0, err = 0;
    if(!data_domain->ads_data_file.obj.fs) return;

    file_size = f_size(&data_domain->ads_data_file);
    if(file_size < data_domain->th) return;
    if((data_domain->fild->buzzer) && (data_domain->buzzer_number)){
        gpio_buzzer_on();
        data_domain->buzzer_number--;
    }

    f_close(&data_domain->ads_data_file);
    err = ads127_bsp_create_file(&data_domain->ads_data_file, &data_domain->file_create_time);
    if((err != FR_OK) && (err != FR_EXIST)){
        ads127_bsp_stop();
        core_mco_disable();
        fs_error_string(name, sizeof(name), err);
        log_printf("无法创建采样数据文件, 停止采样[ERROR: %s]\n", name);
        log_file_close();
        HAL_Delay(3000);
        gpio_buzzer_off();
        HAL_NVIC_SystemReset();
        return;
    }
    ds = rtc_time2str(&data_domain->file_create_time, name, sizeof(name));
    strncpy(&name[ds], ".bin", sizeof(name) - ds);
    log_printf("采样数据文件 %s 创建成功\n", name);
    gpio_buzzer_off();
}

static void exit_gps_time_state_handler(void* state_data, struct event *event){
    UNUSED(event);
    struct gps_domain_data_s *data_domain = (struct gps_domain_data_s *)state_data;
    if(data_domain->gps_uart_handle){
        lpuart1_stop_receive(data_domain->gps_uart_handle);
        lpuart1_deinitialize(&data_domain->gps_uart_handle);
        data_domain->gps_uart_handle = NULL;
    }

}

/* USER CODE END 4 */


/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
    assert_failed((uint8_t *)__FILE__, (uint32_t)__LINE__);

  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
//     SEGGER_RTT_printf(0, "Error: %s on line %d\r\n", file, line);
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

#pragma clang diagnostic pop
